color_dict = {
    "червоний": (255, 0, 0),
    "зелений": (0, 255, 0),
    "синій": (0, 0, 255),
    "жовтий": (255, 255, 0),
    "чорний": (0, 0, 0),
    "білий": (255, 255, 255),
    "фіолетовий": (128, 0, 128),
    "помаранчевий": (255, 165, 0),
    "рожевий": (255, 192, 203),
    "коричневий": (165, 42, 42)
}

# Запитання у користувача назви кольору
color_name = input("Введіть назву кольору: ").strip().lower()

# Виведення RGB коду або повідомлення про відсутність кольору
if color_name in color_dict:
    print(f"RGB код кольору {color_name} - {color_dict[color_name]}")
else:
    print("Колір не знайдено")





